PeterSommerlad/ArduinoCore-avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

microp.name=Peters Micro

microp.vid.0=0x2341
microp.pid.0=0x0037
microp.vid.1=0x2341
microp.pid.1=0x8037
microp.vid.2=0x2A03
microp.pid.2=0x0037
microp.vid.3=0x2A03
microp.pid.3=0x8037
microp.vid.4=0x2341
microp.pid.4=0x0237
microp.vid.5=0x2341
microp.pid.5=0x8237

microp.upload.tool=avrdude
microp.upload.protocol=avr109
microp.upload.maximum_size=28672
microp.upload.maximum_data_size=2560
microp.upload.speed=57600
microp.upload.disable_flushing=true
microp.upload.use_1200bps_touch=true
microp.upload.wait_for_upload_port=true

microp.bootloader.tool=avrdude
microp.bootloader.low_fuses=0xff
microp.bootloader.high_fuses=0xd8
microp.bootloader.extended_fuses=0xcb
microp.bootloader.file=caterina/Caterina-Micro.hex
microp.bootloader.unlock_bits=0x3F
microp.bootloader.lock_bits=0x2F

microp.build.mcu=atmega32u4
microp.build.f_cpu=16000000L
microp.build.vid=0x2341
microp.build.pid=0x8037
microp.build.usb_product="Peters microp"
microp.build.board=AVR_MICRO
microp.build.core=arduino
microp.build.variant=micro
microp.build.extra_flags={build.usb_flags} -DUsePetersCpp17


################# My Uno with Cpp17

unop.name=Peters Uno

unop.vid.0=0x2341
unop.pid.0=0x0043
unop.vid.1=0x2341
unop.pid.1=0x0001
unop.vid.2=0x2A03
unop.pid.2=0x0043
unop.vid.3=0x2341
unop.pid.3=0x0243

unop.upload.tool=avrdude
unop.upload.protocol=arduino
unop.upload.maximum_size=32256
unop.upload.maximum_data_size=2048
unop.upload.speed=115200

unop.bootloader.tool=avrdude
unop.bootloader.low_fuses=0xFF
unop.bootloader.high_fuses=0xDE
unop.bootloader.extended_fuses=0xFD
unop.bootloader.unlock_bits=0x3F
unop.bootloader.lock_bits=0x0F
unop.bootloader.file=optiboot/optiboot_atmega328.hex

unop.build.mcu=atmega328p
unop.build.f_cpu=16000000L
unop.build.board=AVR_UNO
unop.build.core=arduino
unop.build.variant=standard
unop.build.extra_flags=-DUsePetersCpp17
###############################################
megaADKP.name=Peters Mega ADK

megaADKP.vid.0=0x2341
megaADKP.pid.0=0x003f
megaADKP.vid.1=0x2341
megaADKP.pid.1=0x0044
megaADKP.vid.2=0x2A03
megaADKP.pid.2=0x003f
megaADKP.vid.3=0x2A03
megaADKP.pid.3=0x0044

megaADKP.upload.tool=avrdude
megaADKP.upload.protocol=wiring
megaADKP.upload.maximum_size=253952
megaADKP.upload.maximum_data_size=8192
megaADKP.upload.speed=115200

megaADKP.bootloader.tool=avrdude
megaADKP.bootloader.low_fuses=0xFF
megaADKP.bootloader.high_fuses=0xD8
megaADKP.bootloader.extended_fuses=0xFD
megaADKP.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex
megaADKP.bootloader.unlock_bits=0x3F
megaADKP.bootloader.lock_bits=0x0F

megaADKP.build.mcu=atmega2560
megaADKP.build.f_cpu=16000000L
megaADKP.build.board=AVR_ADK
megaADKP.build.core=arduino
megaADKP.build.variant=mega
megaADKP.build.extra_flags=-DUsePetersCpp17

##############################################################

yun.name=Arduino Yún
yun.upload.via_ssh=true

yun.vid.0=0x2341
yun.pid.0=0x0041
yun.vid.1=0x2341
yun.pid.1=0x8041
yun.vid.2=0x2A03
yun.pid.2=0x0041
yun.vid.3=0x2A03
yun.pid.3=0x8041

yun.upload.tool=avrdude
yun.upload.protocol=avr109
yun.upload.maximum_size=28672
yun.upload.maximum_data_size=2560
yun.upload.speed=57600
yun.upload.disable_flushing=true
yun.upload.use_1200bps_touch=true
yun.upload.wait_for_upload_port=true

yun.bootloader.tool=avrdude
yun.bootloader.low_fuses=0xff
yun.bootloader.high_fuses=0xd8
yun.bootloader.extended_fuses=0xfb
yun.bootloader.file=caterina/Caterina-Yun.hex
yun.bootloader.noblink=caterina/Caterina-Yun-noblink.hex
yun.bootloader.unlock_bits=0x3F
yun.bootloader.lock_bits=0x2F

yun.build.mcu=atmega32u4
yun.build.f_cpu=16000000L
yun.build.vid=0x2341
yun.build.pid=0x8041
yun.build.usb_product="Arduino Yun"
yun.build.board=AVR_YUN
yun.build.core=arduino
yun.build.variant=yun
yun.build.extra_flags={build.usb_flags}

##############################################################

uno.name=Arduino Uno

uno.vid.0=0x2341
uno.pid.0=0x0043
uno.vid.1=0x2341
uno.pid.1=0x0001
uno.vid.2=0x2A03
uno.pid.2=0x0043
uno.vid.3=0x2341
uno.pid.3=0x0243

uno.upload.tool=avrdude
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.low_fuses=0xFF
uno.bootloader.high_fuses=0xDE
uno.bootloader.extended_fuses=0xFD
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.bootloader.file=optiboot/optiboot_atmega328.hex

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=AVR_UNO
uno.build.core=arduino
uno.build.variant=standard

##############################################################

diecimila.name=Arduino Duemilanove or Diecimila

diecimila.upload.tool=avrdude
diecimila.upload.protocol=arduino

diecimila.bootloader.tool=avrdude
diecimila.bootloader.low_fuses=0xFF
diecimila.bootloader.unlock_bits=0x3F
diecimila.bootloader.lock_bits=0x0F

diecimila.build.f_cpu=16000000L
diecimila.build.board=AVR_DUEMILANOVE
diecimila.build.core=arduino
diecimila.build.variant=standard

## Arduino Duemilanove or Diecimila w/ ATmega328P
## ----------------------------------------------
diecimila.menu.cpu.atmega328=ATmega328P

diecimila.menu.cpu.atmega328.upload.maximum_size=30720
diecimila.menu.cpu.atmega328.upload.maximum_data_size=2048
diecimila.menu.cpu.atmega328.upload.speed=57600

diecimila.menu.cpu.atmega328.bootloader.high_fuses=0xDA
diecimila.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
diecimila.menu.cpu.atmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

diecimila.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Duemilanove or Diecimila w/ ATmega168
## ---------------------------------------------
diecimila.menu.cpu.atmega168=ATmega168

diecimila.menu.cpu.atmega168.upload.maximum_size=14336
diecimila.menu.cpu.atmega168.upload.maximum_data_size=1024
diecimila.menu.cpu.atmega168.upload.speed=19200

diecimila.menu.cpu.atmega168.bootloader.high_fuses=0xdd
diecimila.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
diecimila.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_diecimila.hex

diecimila.menu.cpu.atmega168.build.mcu=atmega168

